# Chicago Payroll Data


Let's explore real [payroll data of Chicago city](https://www.kaggle.com/chicago/chicago-citywide-payroll-data). This data is available on [kaggle](https://www.kaggle.com) website and can be downloaded using the provided link. <br>




**Links to few similar datasets are given below to explore ang practice your skills.**<br>
&#9758; [City payroll information for all Los Angeles employees since 2013](https://www.kaggle.com/cityofLA/city-payroll-data) <br>
&#9758; [San Francisco city employee salary data](https://www.kaggle.com/kaggle/sf-salaries)<br>
&#9758; [New York City - Citywide Payroll Data](https://www.kaggle.com/new-york-city/nyc-citywide-payroll-data)

#### 1. Import pandas as pd.

In [1]:
import pandas as pd

#### 2. Read City_of_Chicago_Payroll_Data.csv as a dataframe in pay.

In [40]:
pay = pd.read_csv("D:\\Interactive Care\\Data Analysis\\Project\\City_of_Chicago_Payroll_Data.csv")
pay

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

#### 3. Show the first five records in your data.

In [12]:
pay.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN

#### 4. Get the overview of your data.

In [11]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

Notice that:<br>
`Typical Hours` is the only float type. <br>
`Typical Hours`, `Annual Salary` and `Hourly Rate` have lots of NaN or null values.

#### 5. How many 'NaN' do you have in each column in your data?

In [14]:
pay.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

#### 6. Output the statistics for your dataset.

In [18]:
pay.describe(include = 'all')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

#### 7. What are the maximum, minimum and average typical hours? (Use the 'Typical Hours' column.)

In [41]:
print('The maximum Typical Hours are:',pay['Typical Hours'].max())
print('The minimum Typical Hours are:',pay['Typical Hours'].min())
print('The mean/avg Typical Hours are:',pay['Typical Hours'].mean())

The maximum Typical Hours are: 40.0
The minimum Typical Hours are: 10.0
The mean/avg Typical Hours are: 34.69871876189268

#### 8. How many employees are on salary, and how many are working on an hourly basis?

In [42]:
pay[['Salary or Hourly']].value_counts()

Salary or Hourly
Salary              24775
Hourly               7883
Name: count, dtype: int64

### or

In [58]:
pay.groupby('Salary or Hourly')[['Salary or Hourly']].count()

                  Salary or Hourly
Salary or Hourly
Hourly                        7883
Salary                       24775

#### 9. Which department has the maximum number of employees?

In [52]:
pay['Department'].value_counts().head(1)

Department
POLICE    12973
Name: count, dtype: int64

### or

In [55]:
pay.groupby('Department')[['Name']].count().sort_values(by ='Name',  ascending = False).head(1)

             Name
Department
POLICE      12973

### or

In [57]:
pay.groupby('Department')[['Name']].count().idxmax()

Name    POLICE
dtype: object

#### 10. How many employees are on Salary and how many are on Hourly in the Police department?

In [66]:
pay[pay['Department'] == 'POLICE']['Salary or Hourly'].value_counts()

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

### or

In [71]:
pay[pay['Department'] == 'POLICE'].groupby('Salary or Hourly')[['Salary or Hourly']].count()

                  Salary or Hourly
Salary or Hourly
Hourly                          32
Salary                       12941

### or

In [76]:
df = pay[pay['Department'] == 'POLICE']     # By assigning into new variable
df['Salary or Hourly'].value_counts()

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

#### 11. What are the mean, max and min salaries?

In [80]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

##### Annual Salary is a string, so we cannot directly calculate the mean, max, or min from it. Therefore, we first need to convert it into a float.

In [82]:
pay['Salary'] = pay['Annual Salary'].str.replace('$','')

In [87]:
pay['Salary'] = pay['Salary'].str.replace(',', '').astype(float)

In [88]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
 8   Salary             24775 non-null  float64
dtypes: float64(2), object(7)
memory usage: 2.2+ MB

In [134]:
print('The Mean/Avg salary is:', '$', pay['Salary'].mean().round(2))
print('The Max salary is:', '$', pay['Salary'].max().round(2))
print('The Min salary is:', '$', pay['Salary'].min().round(2))

The Mean/Avg salary is: $ 87512.78
The Max salary is: $ 300000.0
The Min salary is: $ 0.96

#### 12. Find the employee who has the maximum salary.

In [105]:
pay[pay['Salary'] == pay['Salary'].max()][['Name', 'Salary']]

                  Name    Salary
8310  EVANS,  GINGER S  300000.0

#### 13. Find the employee who has the minimum salary.

In [106]:
pay[pay['Salary'] == pay['Salary'].min()][['Name', 'Salary']]

                 Name  Salary
15387  KOCH,  STEVEN     0.96

### or

In [114]:
pay.iloc[pay['Salary'].idxmin()]['Name']

'KOCH,  STEVEN '

#### 14. What are the mean, max and min Hourly Rate?

In [125]:
pay['Hourly Ratee'] = pay['Hourly Rate'].str.replace('$', '').astype(float)

In [133]:
print('The Mean Hourly rate is:', '$', pay['Hourly Ratee'].mean().round(2))
print('The Max Hourly rate is:', '$', pay['Hourly Ratee'].max().round(2))
print('The Min Hourly rate is:', '$', pay['Hourly Ratee'].min().round(2))

The Mean Hourly rate is: $ 32.87
The Max Hourly rate is: $ 96.0
The Min Hourly rate is: $ 2.65

#### 15. How many employees are getting max Hourly Rate?

In [145]:
pay[pay['Hourly Ratee'] == pay['Hourly Ratee'].max()].count()['Name']

np.int64(1)

#### 16. Who is getting max Hourly Rate?

In [144]:
pay[pay['Hourly Ratee'] == pay['Hourly Ratee'].max()]['Name']

14317    JONES,  JOHN W
Name: Name, dtype: object

### or

In [146]:
pay.iloc[pay['Hourly Ratee'].idxmax()]['Name']

'JONES,  JOHN W'

#### 17. How many employees are earning less than the average Hourly Rate?

In [148]:
pay[pay['Hourly Ratee'] < pay['Hourly Ratee'].mean()].count()[['Name']]

Name    2791
dtype: int64

#### 18. How many employees are paid hourly and they have full-time job?

In [164]:
pay[(pay['Salary or Hourly'] == 'Hourly') & (pay['Full or Part-Time'] == 'F')].count().head(1)

Name    5906
dtype: int64

In [167]:
pay[(pay['Salary or Hourly'] == 'Hourly') & (pay['Full or Part-Time'] == 'F')].count()['Full or Part-Time']

np.int64(5906)

#### 19. Find the full-time employees who are working at hourly rate of $10.00?

In [172]:
pay[(pay['Full or Part-Time'] == 'F') & (pay['Hourly Ratee'] == 10)]
# pay[(pay['Full or Part-Time']=='F') & (pay['H_Rate']==10)] # or (pay['Hourly Rate']=='$10.00')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hourly Ratee
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

#### 20. How many unique Job Titles are there in the data?

In [173]:
pay['Job Titles'].nunique()

1095

#### 21. What was the average Salary of the employees in each department?

In [175]:
pay.groupby('Department')[['Salary']].mean().round(2)

                         Salary
Department
ADMIN HEARNG           78912.95
ANIMAL CONTRL          66089.68
AVIATION               76140.02
BOARD OF ELECTION      56051.14
BOARD OF ETHICS        94552.50
BUDGET & MGMT          93925.40
BUILDINGS              98864.83
BUSINESS AFFAIRS       80446.42
CITY CLERK             69762.44
CITY COUNCIL           63577.17
COMMUNITY DEVELOPMENT  88363.26
COPA                   98784.71
CULTURAL AFFAIRS       87048.91
DISABILITIES           82431.72
DoIT                   99681.03
FAMILY & SUPPORT       79013.59
FINANCE                73276.36
FIRE                   97762.35
GENERAL SERVICES       83095.53
HEALTH                 85488.21
HUMAN RELATIONS        93778.59
HUMAN RESOURCES        79851.76
INSPECTOR GEN          84030.67
IPRA                   94429.29
LAW                    84582.81
LICENSE APPL COMM      80568.00
MAYOR'S OFFICE         96165.51
OEMC                   73153.78
POLICE                 87836.03
POLICE BOARD           86136.00
PROCUREMENT            83278.24
PUBLIC LIBRARY         71273.29
STREETS & SAN          84347.78
TRANSPORTN             89976.90
TREASURER              88062.65
WATER MGMNT            89894.11

#### 22. What is the job title of 'AGAR,  BULENT B'?** please note, there are two spaces between AGAR, and BULENT.

In [181]:
pay[pay['Name'] == 'AGAR,  BULENT B']['Job Titles']

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

In [183]:
name = input('Enter your name:')
result = pay[pay['Name'] == name]['Job Titles']
result

Enter your name: AGAR,  BULENT B

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

#### 23. What are the top most common job titles?

In [185]:
pay['Job Titles'].value_counts().head(1)

Job Titles
POLICE OFFICER    9393
Name: count, dtype: int64

#### 24. How many people have the word 'officer' in their job title? (This is pretty tricky)

In [187]:
def find_string(title):
    if 'officer' in title.lower():
        return True
    else:
        return False

In [188]:
pay['Job Titles'].apply(find_string).sum()

np.int64(11101)

### or

In [189]:
sum(pay['Job Titles'].apply(find_string))

11101

### or

In [190]:
pay[pay['Job Titles'].str.contains('officer', case=False)].count()['Name']

np.int64(11101)